'''
Problem 1:
將一個任意長度串列，並依每列指定的行數來將串列內容呈現出來。

def show_list(lst, cols):
    pass
    
請隨機生成一個長度在 20 ~ 30 間的串列，同時將元素內容以隨機產生的數值填入，數值範圍為 1 ~ 99。
接著呼叫上述函式來將串列的內容顯示出來。
例如，假設已經產生的隨機串列 lst 內容如下:
lst = [86, 27, 7, 26, 30, 85, 88, 77, 80, 60, 97, 88, 42, 46, 61, 58, 14, 15, 88, 5, 66, 89, 8, 55, 11]

1) 呼叫 show_list(lst, 5)，的輸出結果:
86 27  7 26 30 
85 88 77 80 60 
97 88 42 46 61 
58 14 15 88  5 
66 89  8 55 11 

---------------
2) 呼叫 show_list(lst, 7)，的輸出結果:
86 27  7 26 30 85 88 
77 80 60 97 88 42 46 
61 58 14 15 88  5 66 
89  8 55 11 
'''
import random as rand
lst = [0] * rand.randint(20, 30)

def show_list (lst, cols):
    for